NXP-MCU-X-Lab/nxp_easy_mcuboot/Project/frdm_mcxc162/mcxc162_example_app/drivers/fsl_common_arm.h
#if defined(FSL_FEATURE_L1DCACHE_LINESIZE_BYTE)
#define CACHE_LINE_DATA SDK_L1DCACHE_ALIGN
#elif defined(FSL_FEATURE_L2CACHE_LINESIZE_BYTE)
#define CACHE_LINE_DATA SDK_L2CACHE_ALIGN
#endif

#if (defined(__ICCARM__))
#define AT_CACHE_LINE_SECTION(var)                   CACHE_LINE_DATA(var) @"CacheLineData"
#define AT_CACHE_LINE_SECTION_INIT(var)              CACHE_LINE_DATA(var) @"CacheLineData.init"

#elif (defined(__CC_ARM) || defined(__ARMCC_VERSION))
#if (defined(__CC_ARM))
#define AT_CACHE_LINE_SECTION(var)                   __attribute__((section("CacheLineData"), zero_init)) CACHE_LINE_DATA(var)
#else
#define AT_CACHE_LINE_SECTION(var)                   __attribute__((section("CacheLineData"))) CACHE_LINE_DATA(var)
#endif
#define AT_CACHE_LINE_SECTION_INIT(var)              __attribute__((section("CacheLineData.init"))) CACHE_LINE_DATA(var)

#elif (defined(__GNUC__)) || defined(DOXYGEN_OUTPUT)
#define AT_CACHE_LINE_SECTION(var)                   __attribute__((section("CacheLineData,\"aw\",%nobits @"))) CACHE_LINE_DATA(var)
#define AT_CACHE_LINE_SECTION_INIT(var)              __attribute__((section("CacheLineData.init"))) CACHE_LINE_DATA(var)

#else
#error Toolchain not supported.
#endif

/*! @} */

/*!
 * @name Time sensitive region
 * @{
 */

/*!
 * @def AT_QUICKACCESS_SECTION_CODE(func)
 * Place function in a section which can be accessed quickly by core.
 *
 * @def AT_QUICKACCESS_SECTION_DATA(var)
 * Place data in a section which can be accessed quickly by core.
 *
 * @def AT_QUICKACCESS_SECTION_DATA_ALIGN(var, alignbytes)
 * Place data in a section which can be accessed quickly by core, and the variable
 * address is set to align with \a alignbytes.
 */
#if (defined(FSL_SDK_DRIVER_QUICK_ACCESS_DISABLE) && (FSL_SDK_DRIVER_QUICK_ACCESS_DISABLE + 0))
#define AT_QUICKACCESS_SECTION_CODE(func) func
#define AT_QUICKACCESS_SECTION_DATA(var) var
#define AT_QUICKACCESS_SECTION_DATA_ALIGN(var, alignbytes) SDK_ALIGN(var, alignbytes)
#elif (defined(__ICCARM__))
#define AT_QUICKACCESS_SECTION_CODE(func) func @"CodeQuickAccess"
#define AT_QUICKACCESS_SECTION_DATA(var)  var @"DataQuickAccess"
#define AT_QUICKACCESS_SECTION_DATA_ALIGN(var, alignbytes) \
    SDK_PRAGMA(data_alignment = alignbytes) var @"DataQuickAccess"
#elif (defined(__CC_ARM) || defined(__ARMCC_VERSION))
#define AT_QUICKACCESS_SECTION_CODE(func) __attribute__((section("CodeQuickAccess"), __noinline__)) func
#define AT_QUICKACCESS_SECTION_DATA(var)  __attribute__((section("DataQuickAccess"))) var
#define AT_QUICKACCESS_SECTION_DATA_ALIGN(var, alignbytes) \
    __attribute__((section("DataQuickAccess"))) __attribute__((aligned(alignbytes))) var
#elif (defined(__GNUC__)) || defined(DOXYGEN_OUTPUT)
#define AT_QUICKACCESS_SECTION_CODE(func) __attribute__((section("CodeQuickAccess"), __noinline__)) func
#define AT_QUICKACCESS_SECTION_DATA(var)  __attribute__((section("DataQuickAccess"))) var
#define AT_QUICKACCESS_SECTION_DATA_ALIGN(var, alignbytes) \
    __attribute__((section("DataQuickAccess"))) var __attribute__((aligned(alignbytes)))
#else
#error Toolchain not supported.
#endif /* QuickAccess section macro */
/*! @} */

/*!
 * @name Ram Function
 * @{
 */

/*!
 * @def MCUX_RAMFUNC
 * Function attribute to place function in RAM. For example, to place
 * function my_func in ram, use like:
 * @code
 * MCUX_RAMFUNC my_func
 * @endcode
 */
#if (defined(__ICCARM__))
#define MCUX_RAMFUNC __ramfunc
#elif (defined(__CC_ARM) || defined(__ARMCC_VERSION))
#define MCUX_RAMFUNC __attribute__((noinline)) __attribute__((section(".ramfunc")))
#elif (defined(__GNUC__)) || defined(DOXYGEN_OUTPUT)
#define MCUX_RAMFUNC __attribute__((noinline)) __attribute__((long_call, section(".ramfunc")))
#else
#error Toolchain not supported.
#endif /* defined(__ICCARM__) */

/*!
 * @def RAMFUNCTION_SECTION_CODE(func)
 * Place function in ram.
 */
#define RAMFUNCTION_SECTION_CODE(func) MCUX_RAMFUNC func

/*! @} */

/*!
 * @name Label for Deprecated or Experimental functions
 *
 * The deprecated functions will be removed in next release.
 * The experimental functions might be removed at any time.
 * Avoid using them.
 * @{
 */

/*!
 * @brief Deprecated APIs
 */
#define MCUX_DEPRECATED __attribute__((deprecated("Deprecated feature")))

/*!
 * @brief Deprecated macros
 */
#if (defined(__ICCARM__))
#define MCUX_DEPRECATED_MACRO _Pragma("message(\"Warning: Deprecated macro\")")
#else
#define MCUX_DEPRECATED_MACRO _Pragma("GCC warning \"Deprecated macro\"")
#endif

/*!
 * @brief Experimental APIs
 */
#define MCUX_EXPERIMENTAL __attribute__((deprecated("Experimental feature")))

/*!
 * @brief Experimental macros
 */
#if (defined(__ICCARM__))
#define MCUX_EXPERIMENTAL_MACRO _Pragma("message(\"Warning: Experimental macro\")")
#else
#define MCUX_EXPERIMENTAL_MACRO _Pragma("GCC warning \"Experimental macro\"")
#endif

/*! @} */

/*!
 * @def MSDK_REG_SECURE_ADDR(x)
 * Convert the register address to the one used in secure mode.
 *
 * @def MSDK_REG_NONSECURE_ADDR(x)
 * Convert the register address to the one used in non-secure mode.
 */

#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
#define MSDK_REG_SECURE_ADDR(x) ((uintptr_t)(x) | (0x1UL << 28))
#define MSDK_REG_NONSECURE_ADDR(x) ((uintptr_t)(x) & ~(0x1UL << 28))
#else
#define MSDK_REG_SECURE_ADDR(x) (x)
#define MSDK_REG_NONSECURE_ADDR(x) (x)
#endif

/*!
 * @brief The chip supports DWT CYCCNT or not.
 */
#if (defined(DWT) && defined(DWT_CTRL_CYCCNTENA_Msk))
#define MSDK_HAS_DWT_CYCCNT 1
#else
#define MSDK_HAS_DWT_CYCCNT 0
#endif

/*!
 * @brief Invalid IRQ handler address.
 */
#define MSDK_INVALID_IRQ_HANDLER UINT32_MAX

#if defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
        void DefaultISR(void);
#endif

/*
 * The fsl_clock.h is included here because it needs MAKE_VERSION/MAKE_STATUS/status_t
 * defined in previous of this file.
 */
#include "fsl_clock.h"

/*
 * Chip level peripheral reset API, for MCUs that implement peripheral reset control external to a peripheral
 */
#if ((defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0)) || \
     (defined(FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT) && (FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT > 0)))
#include "fsl_reset.h"
#endif

